cases/Day-1/Part-1.3_Tutorial/squareChannelConv_T_sol/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.1;
    }

    outlet
    {
        type            zeroGradient;
    }

    bottom
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }

    heater
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }

    top
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }

    front
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }

    back
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
}


// ************************************************************************* //
